Revit 2027 API
ViewActivatedEventArgs.CurrentActiveView Property
 The view that has just become active.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View CurrentActiveView { get; }
Public ReadOnly Property CurrentActiveView As View
	Get
public:
property View^ CurrentActiveView {
	View^ get ();
}
member CurrentActiveView : View with get
Property Value
View
See Also
Reference
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace